# Sources
tap 'caskroom/cask'
tap 'homebrew/cask-fonts'

# CLI Utilities
brew 'bash-completion'
brew 'git'
brew 'libdvdcss'
brew 'trash'
brew 'nano'
brew 'imagemagick'
brew 'wget'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-json'

# Fonts
cask 'font-fira-code'
cask 'font-fira-mono'

# Apps
cask 'adobe-creative-cloud'
cask 'backblaze'
cask 'chatology'
cask 'discord'
cask 'doxie'
cask 'firefox'
cask 'firefox-developer-edition'
cask 'google-chrome-canary'
cask 'grammarly'
cask 'handbrake'
cask 'iina'
cask 'imazing'
cask 'kaleidoscope'
cask 'little-snitch'
cask 'logitech-options'
cask 'loopback'
cask 'makemkv'
cask 'max'
cask 'micro-snitch'
cask 'microsoft-edge'
cask 'mkvtoolnix'
cask 'panic-unison'
cask 'rescuetime'
cask 'rocket'
cask 'sketch'
cask 'soulver'
cask 'spamsieve'
cask 'superduper'
cask 'tower'
cask 'transmission'
cask 'undercover'
cask 'unlox'
cask 'vanilla'
cask 'visual-studio-code'
cask 'xld'

# Screen Saver
cask 'aerial'
